Gets array of line weights.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
  Since:  2013
 Syntax
  C#
public IList<int> GetLineWeights()
  Visual Basic
Public Function GetLineWeights As IList(Of Integer)
  Visual C++
public:
IList<int>^ GetLineWeights()
 See Also
  DWGImportOptions Class
  Autodesk.Revit.DB Namespace